In [1]:
import pandas as pd

In [2]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [3]:
print(pd.__version__)

2.1.4

In [4]:
a = [1, 7, 2]

myvar_1 = pd.Series(a)

print(myvar_1)

0    1
1    7
2    2
dtype: int64

In [5]:
print(myvar_1[0])

1

In [6]:
a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [7]:
print(myvar["y"])

7

In [8]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [9]:
print(myvar["day1"])

420

In [10]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

print(myvar)

day1    420
day2    380
dtype: int64

In [12]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45],
    "Value": [123, 250, 300]
}

myvar = pd.DataFrame(data)

print(myvar)

   calories  duration  Value
0       420        50    123
1       380        40    250
2       390        45    300

In [13]:
print(myvar.loc[0])

calories    420
duration     50
Value       123
Name: 0, dtype: int64

In [14]:
print(myvar.loc[[0, 1]])

   calories  duration  Value
0       420        50    123
1       380        40    250

In [16]:
print(myvar.duration)

0    50
1    40
2    45
Name: duration, dtype: int64

In [17]:
print(myvar.calories)

0    420
1    380
2    390
Name: calories, dtype: int64

## Reading data from a .csv file

In [18]:
df = pd.read_csv("sample.csv")

In [19]:
df

,id,first_name,last_name,email,gender,ip_address
0,1,Adamo,Rycraft,arycraft0@alibaba.com,Male,82.81.150.227
1,2,Ronald,Bunstone,rbunstone1@com.com,Male,204.53.254.54
2,3,Jandy,Marcroft,jmarcroft2@phpbb.com,Female,118.111.61.235
3,4,Cyndia,Benck,cbenck3@tuttocitta.it,Female,75.124.22.80
4,5,Bessie,Jotcham,bjotcham4@dell.com,Female,161.39.178.193
...,...,...,...,...,...,...
995,996,Hunfredo,Giannazzi,hgiannazzirn@prlog.org,Male,155.86.98.116
996,997,Cristobal,Blodget,cblodgetro@cpanel.net,Male,231.32.136.126
997,998,Mildrid,Badam,mbadamrp@chicagotribune.com,Female,15.26.74.240
998,999,Kimmi,Drinkwater,kdrinkwaterrq@geocities.com,Female,133.10.4.238
999,1000,Ortensia,Rolstone,orolstonerr@imdb.com,Bigender,46.218.124.31

In [22]:
# viewing the first five rows

In [20]:
df.head()

   id first_name last_name                  email  gender      ip_address
0   1      Adamo   Rycraft  arycraft0@alibaba.com    Male   82.81.150.227
1   2     Ronald  Bunstone     rbunstone1@com.com    Male   204.53.254.54
2   3      Jandy  Marcroft   jmarcroft2@phpbb.com  Female  118.111.61.235
3   4     Cyndia     Benck  cbenck3@tuttocitta.it  Female    75.124.22.80
4   5     Bessie   Jotcham     bjotcham4@dell.com  Female  161.39.178.193

In [23]:
# viewing the last five rows

In [21]:
df.tail()

,id,first_name,last_name,email,gender,ip_address
995,996,Hunfredo,Giannazzi,hgiannazzirn@prlog.org,Male,155.86.98.116
996,997,Cristobal,Blodget,cblodgetro@cpanel.net,Male,231.32.136.126
997,998,Mildrid,Badam,mbadamrp@chicagotribune.com,Female,15.26.74.240
998,999,Kimmi,Drinkwater,kdrinkwaterrq@geocities.com,Female,133.10.4.238
999,1000,Ortensia,Rolstone,orolstonerr@imdb.com,Bigender,46.218.124.31

In [25]:
# to load the whole dataset

In [26]:
# print(df.to_string())

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   email       1000 non-null   object
 4   gender      1000 non-null   object
 5   ip_address  1000 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.0+ KB

In [28]:
print(pd.options.display.max_rows)

60

In [29]:
df = pd.read_json('sample_json.json')

In [30]:
df

,id,first_name,last_name,email,gender,ip_address
0,1,Giuditta,Garlic,ggarlic0@tinyurl.com,Female,125.212.228.253
1,2,Colline,Messager,cmessager1@yandex.ru,Female,163.143.102.144
2,3,Erv,Bremeyer,ebremeyer2@bravesites.com,Male,175.105.83.59
3,4,Rena,Ramey,rramey3@admin.ch,Female,220.132.245.64
4,5,Irvin,Cooke,icooke4@g.co,Male,197.110.237.182
...,...,...,...,...,...,...
995,996,Carolann,Cruces,ccrucesrn@wired.com,Female,62.73.33.206
996,997,Margarete,Fishbourne,mfishbournero@biglobe.ne.jp,Female,200.217.122.173
997,998,Babette,Ealam,bealamrp@tmall.com,Female,68.0.99.9
998,999,Leroi,Tassaker,ltassakerrq@blinklist.com,Male,198.79.41.11
999,1000,Griff,Pedri,gpedrirr@vimeo.com,Male,43.176.90.52

## Data from anywhere in your system

In [33]:
df = pd.read_csv("C:/Users/SkillCircle/Downloads/netflix_titles.csv")

In [34]:
df

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [38]:
df.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64